rule Azure_Defender_365_A_user_clicked_through_to_a_potentially_malicious_url {

    meta:       
        author = "Testing"
        event_name = "Azure - Defender 365 - A user clicked through to a potentially  malicious URL"
        severity = "Medium"
        
        description = ""
        mitre_attack_tactic = "TA0001,TA0002"
        mitre_attack_technique = "T1566.002,T1071.001"

        tipo_tratamento = "Manual"
        categoria = "XXX"

    events:
        (
            $event.metadata.log_type = "MICROSOFT_GRAPH_ALERT"
            or $event.metadata.log_type = "MICROSOFT_DEFENDER_ENDPOINT"
            or $event.metadata.log_type = "OFFICE_365"
        )

        (
            any $event.security_result.rule_name = /A user clicked through to a potentially malicious URL|A potentially malicious URL click was detected/ nocase
            or any $event.security_result.threat_name = /A user clicked through to a potentially malicious URL|A potentially malicious URL click was detected/ nocase
            or any $event.security_result.summary = /A user clicked through to a potentially malicious URL|A potentially malicious URL click was detected/ nocase
        )

        $AlertID = $event.metadata.product_log_id

    match:
        $AlertID over 15m

    outcome:
        
    condition:
        $event
}
