rule Azure_Defender_365_Possivel_Arquivo_com_Extensao_Suspeita {

    meta:       
        author = "Testing"
        event_name = "Azure - Defender 365 - Possivel Arquivo com Extensao Suspeita"
        severity = "Medium"
        
        description = ""
        mitre_attack_tactic = "TA0005"
        mitre_attack_technique = "T1036.004,t1190"

        tipo_tratamento = "Manual"
        categoria = "XXX"

    events:
        (
            $event.metadata.log_type = "MICROSOFT_GRAPH_ALERT"
            or $event.metadata.log_type = "MICROSOFT_DEFENDER_ENDPOINT"
            or $event.metadata.log_type = "OFFICE_365"
        )

        (
            any $event.security_result.rule_name = "Possivel Arquivo com Extensao Suspeita" nocase
            or any $event.security_result.threat_name = "Possivel Arquivo com Extensao Suspeita" nocase
            or any $event.security_result.summary = "Possivel Arquivo com Extensao Suspeita" nocase
        )

        $AlertID = $event.metadata.product_log_id

    match:
        $AlertID over 15m

    outcome:
        
    condition:
        $event
}
